In [2]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("C:/Users/user/OneDrive/Desktop/Career/Data Glacier VI/VC-1/DataSets/Cab_Data.csv")
df = df[['Date of Travel', 'Company']]

In [6]:
df['Company'] = \ 
df['Company'] \
  / pd.to_datetime(df['Date of Travel']).dt.day
df = set_date_index(df, 'Date')

SyntaxError: unexpected character after line continuation character (<ipython-input-6-759e9c753aa8>, line 1)

In [27]:
df.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10433076,02/01/2016,Pink Cab,ATLANTA GA,17.82,238.62,190.674
1,10433087,02/01/2016,Pink Cab,AUSTIN TX,35.52,502.96,369.408
2,10433097,02/01/2016,Pink Cab,AUSTIN TX,28.50,411.40,336.300
3,10433128,02/01/2016,Pink Cab,BOSTON MA,29.97,390.42,317.682
4,10433131,02/01/2016,Pink Cab,BOSTON MA,27.27,370.20,324.513

In [36]:
df['Date of Travel'].value_counts(normalize=True)

05/01/2018    0.005626
15/12/2017    0.003125
08/12/2017    0.003061
15/12/2018    0.003022
24/11/2017    0.003019
                ...
19/01/2016    0.000245
12/01/2016    0.000239
11/01/2016    0.000237
05/01/2016    0.000131
04/01/2016    0.000070
Name: Date of Travel, Length: 1095, dtype: float64

In [38]:
df.reset_index(inplace=True)

In [41]:
#creating new date columns
df['Day'] = df['Date of Travel'].dt.day
df['Month'] = df['Date of Travel'].dt.month
df['Year'] = df['Date of Travel'].dt.year

In [42]:
df.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip,Day,Month,Year
0,10000011,2016-08-01,Pink Cab,ATLANTA GA,30.45,370.95,313.635,1,8,2016
1,10000012,2016-06-01,Pink Cab,ATLANTA GA,28.62,358.52,334.854,1,6,2016
2,10000013,2016-02-01,Pink Cab,ATLANTA GA,9.04,125.20,97.632,1,2,2016
3,10000014,2016-07-01,Pink Cab,ATLANTA GA,33.17,377.40,351.602,1,7,2016
4,10000015,2016-03-01,Pink Cab,ATLANTA GA,8.73,114.62,97.776,1,3,2016

In [55]:
df.pivot_table(values='Price Charged', index='Year', columns='Company', aggfunc='mean')

Company    Pink Cab  Yellow Cab
Year
2016     315.330113  467.918301
2017     315.907442  466.639950
2018     301.642530  440.875558

In [47]:
print(df.columns)

Index(['Transaction ID', 'Date of Travel', 'Company', 'City', 'KM Travelled',
       'Price Charged', 'Cost of Trip', 'Day', 'Month', 'Year'],
      dtype='object')

In [49]:
df.shape

(359392, 10)

In [51]:
df['Year']

0         2016
1         2016
2         2016
3         2016
4         2016
          ...
359387    2018
359388    2018
359389    2018
359390    2018
359391    2018
Name: Year, Length: 359392, dtype: int64

In [52]:
df['Month']

0         8
1         6
2         2
3         7
4         3
         ..
359387    8
359388    4
359389    5
359390    5
359391    2
Name: Month, Length: 359392, dtype: int64

In [53]:
df['Day']

0         1
1         1
2         1
3         1
4         1
         ..
359387    1
359388    1
359389    1
359390    1
359391    1
Name: Day, Length: 359392, dtype: int64

In [54]:
df.get('Year')

0         2016
1         2016
2         2016
3         2016
4         2016
          ...
359387    2018
359388    2018
359389    2018
359390    2018
359391    2018
Name: Year, Length: 359392, dtype: int64